# items.py

# Этот словарь будет содержать все игровые предметы.
# Ключ - это ID предмета (лучше использовать уникальную строку, а не эмодзи,
# но для текущей реализации с эмодзи пока оставим так).
# Значение - это словарь с свойствами предмета.

GAME_ITEMS = {
    # --- ПЛАТНЫЕ ПРЕДМЕТЫ ПО ВОЗРАСТАНИЮ ЦЕНЫ ---
    "🎲": {
        "name": "Игральная кость",
        "description": "Для команды /dice",
        "price": 1,
        "emoji": "🎲"
    },
    "🍺": {
        "name": "Пиво",
        "description": "Для смелых алкашей",
        "price": 5,
        "emoji": "🍺"
    },
    "💦": {
        "name": "Спрей для хуя",
        "description": "Можно подрочить ещё раз",
        "price": 5,
        "emoji": "💦"
    },
    "💉": {
        "name": "Шприц с тестостероном",
        "description": "Возобновляет упавший член",
        "price": 7,
        "emoji": "💉"
    },
    "📕": {
        "name": "Журнал “FamHub”",
        "description": "Если вдруг достала порнуха",
        "price": 7,
        "emoji": "📕"
    },
    "🫖": {
        "name": "Чай",
        "description": "Для бодрости",
        "price": 7,
        "emoji": "🫖"
    },
    "📘": {
        "name": "Теория крафта",
        "description": "Пособие по крафту",
        "price": 8,
        "emoji": "📘"
    },
    "👾": {
        "name": "Пиксель",
        "description": "Пикселизирует",
        "price": 10,
        "emoji": "👾"
    },
    "🌫": {
        "name": "Цемент",
        "description": "Для строительства дома",
        "price": 10,
        "emoji": "🌫"
    },
    "🟢": {
        "name": "Pop It",
        "description": "Антистресс",
        "price": 10,
        "emoji": "🟢"
    },
    "🟪": {
        "name": "Pop It",
        "description": "Антистресс",
        "price": 10,
        "emoji": "🟪"
    },
    "🔴": {
        "name": "Pop It",
        "description": "Антистресс",
        "price": 10,
        "emoji": "🔴"
    },
    "🟡": {
        "name": "Pop It",
        "description": "Антистресс",
        "price": 10,
        "emoji": "🟡"
    },
    "🔵": {
        "name": "Pop It",
        "description": "Антистресс",
        "price": 10,
        "emoji": "🔵"
    },
    "🟠": {
        "name": "Pop It",
        "description": "Антистресс",
        "price": 10,
        "emoji": "🟠"
    },
    "🟣": {
        "name": "Pop It",
        "description": "Антистресс",
        "price": 10,
        "emoji": "🟣"
    },
    "💜": {
        "name": "Pop It",
        "description": "Антистресс",
        "price": 10,
        "emoji": "💜"
    },

    "🛌": {
        "name": "Одеяло",
        "description": "Можно спрятаться от мамки",
        "price": 15,
        "emoji": "🛌"
    },

    "🔑": {
        "name": "Ключ",
        "description": "Позволяет снять пояс верности",
        "price": 15,
        "emoji": "🔑"
    },
    "🔘": {
        "name": "Simple Dimple",
        "description": "Антистресс",
        "price": 15,
        "emoji": "🔘"
    },
    "🥕": {
        "name": "Морковь",
        "description": "Для крафта снеговика",
        "price": 20,
        "emoji": "🥕"
    },
    "💊": {
        "name": "АнтиКроп",
        "description": "Если вдруг заразился",
        "price": 24,
        "emoji": "💊"
    },
    "🧃": {
        "name": "Сок “Чистая Линия”",
        "description": "Для отчима",
        "price": 25,
        "emoji": "🧃"
    },
    "👝": {
        "name": "Кейс с шмотом",
        "description": "С подарком",
        "price": 25,
        "emoji": "👝"
    },
    "💫": {
        "name": "Волшебная палочка",
        "description": "Снимает все ограничения",
        "price": 35,
        "emoji": "💫"
    },
    "🎒": {
        "name": "Рюкзак",
        "description": "Для вещей",
        "price": 135,
        "emoji": "🎒"
    },
    "🇹🇲": {
        "name": "Флаг Туркменистана",
        "description": "Для туркменов)",
        "price": 130,
        "emoji": "🇹🇲"
    },
    "🇬🇪": {
        "name": "Флаг Грузии",
        "description": "Для жителей Грузии)",
        "price": 135,
        "emoji": "🇬🇪"
    },
    "🇨🇭": {
        "name": "Флаг Швейцарии",
        "description": "Для швейцарцев)",
        "price": 135,
        "emoji": "🇨🇭"
    },
    "🇮🇪": {
        "name": "Флаг Ирландии",
        "description": "Для ирландцев)",
        "price": 140,
        "emoji": "🇮🇪"
    },
    "🇪🇬": {
        "name": "Флаг Египта",
        "description": "Для египтян)",
        "price": 140,
        "emoji": "🇪🇬"
    },
    "🇵🇱": {
        "name": "Флаг Польша",
        "description": "Для жителей Польши)",
        "price": 140,
        "emoji": "🇵🇱"
    },
    "🇦🇫": {
        "name": "Флаг Афганистана",
        "description": "Для жителей Афганистана)",
        "price": 140,
        "emoji": "🇦🇫"
    },
    "🇨🇺": {
        "name": "Флаг Кубы",
        "description": "Для кубинцев)",
        "price": 150,
        "emoji": "🇨🇺"
    },
    "🇰🇷": {
        "name": "Флаг Южной Кореи",
        "description": "Для кейпоперов)",
        "price": 150,
        "emoji": "🇰🇷"
    },
    "🇦🇿": {
        "name": "Флаг Азербайджана",
        "description": "Для азербайджанцев)",
        "price": 150,
        "emoji": "🇦🇿"
    },
    "🇰🇿": {
        "name": "Флаг Казахстана",
        "description": "Для казахов)",
        "price": 150,
        "emoji": "🇰🇿"
    },
    "🇸🇪": {
        "name": "Флаг Швеции",
        "description": "Для шведов)",
        "price": 150,
        "emoji": "🇸🇪"
    },
    "🇬🇧": {
        "name": "Флаг Великобритании",
        "description": "Для британцев)",
        "price": 150,
        "emoji": "🇬🇧"
    },
    "🇹🇯": {
        "name": "Флаг Таджикистана",
        "description": "Для таджиков)",
        "price": 150,
        "emoji": "🇹🇯"
    },
    "🇺🇿": {
        "name": "Флаг Узбекистана",
        "description": "Для узбеков)",
        "price": 150,
        "emoji": "🇺🇿"
    },
    "🇧🇾": {
        "name": "Флаг Беларуси",
        "description": "Для Белорусов)",
        "price": 150,
        "emoji": "🇧🇾"
    },
    "🇫🇷": {
        "name": "Флаг Франции",
        "description": "Для французов)",
        "price": 150,
        "emoji": "🇫🇷"
    },
    "🇨🇿": {
        "name": "Флаг Чехии",
        "description": "Для чехов)",
        "price": 150,
        "emoji": "🇨🇿"
    },
    "🇦🇺": {
        "name": "Флаг Австралии",
        "description": "Для австралийцев)",
        "price": 155,
        "emoji": "🇦🇺"
    },
    "🇲🇻": {
        "name": "Флаг Мальдив",
        "description": "Тупа для атдыхающих",
        "price": 160,
        "emoji": "🇲🇻"
    },
    "🇺🇸": {
        "name": "Флаг США",
        "description": "Для пиндосов)",
        "price": 175,
        "emoji": "🇺🇸"
    },
    "🇷🇺": {
        "name": "Флаг России",
        "description": "Для москалей)",
        "price": 175,
        "emoji": "🇷🇺"
    },
    "🏳️‍🌈": {
        "name": "Флаг ЛГБТ",
        "description": "Для пидарасов)",
        "price": 175,
        "emoji": "🏳️‍🌈"
    },
    "🇺🇦": {
        "name": "Флаг Украины",
        "description": "Для хохлов)",
        "price": 175,
        "emoji": "🇺🇦"
    },
    "📻": {
        "name": "Ебаное радио",
        "description": "Послушать радиовещание",
        "price": 200,
        "emoji": "📻"
    },
    "🇯🇵": {
        "name": "Флаг Японии",
        "description": "Для Японцев)",
        "price": 500,
        "emoji": "🇯🇵"
    },
    "🐈": {
        "name": "Кот",
        "description": "Снимает стресс раз в 5 минут",
        "price": 700,
        "emoji": "🐈",
        "currency": "🪙"
    },

    "🚰": {
        "name": "Дозатор спрея",
        "description": "Автоматически применяет спрей после дрочки",
        "price": 225,
        "emoji": "🚰"
    },
    "🖼": {
        "name": "Картина худроочера",
        "description": "Личная картина",
        "price": 500,
        "emoji": "🖼"


    },
    "👓": {
        "name": "Очки ботана",
        "description": "Позволяет лучше видеть Порнушку (повышение выносливости на 10%)",
        "price": 350,
        "emoji": "👓"
    },
    "🧤": {
        "name": "Перчатки",
        "description": "Для лучшего скольжения руки (повышение выносливости на 12%)",
        "price": 425,
        "emoji": "🧤"
    },
    "🧴": {
        "name": "Мыло",
        "description": "Чистота превыше всего (повышение выносливости на 13%)",
        "price": 450,
        "emoji": "🧴"
    },
    "🪖": {
        "name": "Бронекаска",
        "description": "Защищает от кирпича",
        "price": 1500,
        "emoji": "🪖"
    },
    "🥼": {
        "name": "Халат бати",
        "description": "Делает дрочку удобнее (повышение выносливости на 15%)",
        "price": 550,
        "emoji": "🥼"
    },
    "😷": {
        "name": "Маска",
        "description": "На 90% защищает от болезней, но снижает выносливость на 1%",
        "price": 600,
        "emoji": "😷"
    },
    "🍓": {
        "name": "Клубника",
        "description": "Удваивает количество лута на плантации",
        "price": 600,
        "emoji": "🍓",
        "currency": "🪙"
    },
    "🔎": {
        "name": "Лупа-подзалупа",
        "description": "+100см при использовании",
        "price": 750,
        "emoji": "🔎"
    },
    "🤖": {
        "name": "Avtorob 3.14",
        "description": "Дрочит тебе раз в 2 часа автоматически",
        "price": 800,
        "emoji": "🤖"
    },
    "🎱": {
        "name": "Шар №8",
        "description": "Предсказатель (повышение удачи на 5%)",
        "price": 1000,
        "emoji": "🎱"
    },
    "🎩": {
        "name": "Цилиндр",
        "description": "Делает тебя незаметным (повышение удачи на 5%)",
        "price": 1000,
        "emoji": "🎩"
    },

    "🧱": {
        "name": "Кирпич",
        "description": "Кого-нибудь ёбнуть",
        "price": 1150,
        "emoji": "🧱"
    },

    "🧿": {
        "name": "Амулет греков",
        "description": "Древние знали толк в дрочке (повышение удачи на 7%)",
        "price": 1500,
        "emoji": "🧿"
    },
    "🔌": {
        "name": "Вилка для Автодрочера",
        "description": "Увеличивает количество дрочек роботом до 4-6",
        "price": 2000,
        "emoji": "🔌"
    },
    "📍": {
        "name": "Чупик",
        "description": "Для горлатых (повышает удачу на 3%)",
        "price": 2500,
        "emoji": "📍"
    },
    "🔍": {
        "name": "Супер-лупа-подзалупа",
        "description": "+1000см при использовании",
        "price": 5000,
        "emoji": "🔍"
    },
    "📓": {
        "name": "Инструкция по дрочкам от Наставника”",
        "description": "Даёт знания о дрочке (повышение удачи на 20%)",
        "price": 5000,
        "emoji": "📓"
    },

    # --- БЕСПЛАТНЫЕ ПРЕДМЕТЫ И ПРОЧЕЕ (В САМОМ НИЗУ) ---
    "🎀": {
        "name": "Адвент-календарь",
        "description": "10 подарков",
        "price": 15000,
        "emoji": "🎀"
    },
    "💝": {
        "name": "Адвент-календарь Lite",
        "description": "10 подарков",
        "price": 0,
        "emoji": "💝"
    },
    "🎂": {
        "name": "Торт Наполеон",
        "description": "Для праздника",
        "price": 0,
        "emoji": "🎂"
    },
    "🚛": {
        "name": "KAMAZ",
        "description": "Гони Саня, гони! Быстрей...",
        "price": 0,
        "emoji": "🚛"
    },

    "🚚": {
    "name": "ГАЗель",
    "description": "Вот это прикол!",
    "price": 0,
    "emoji": "🚚"

    },
    "📊": {
        "name": "Анализатор цен",
        "description": "Статистика по трейдам",
        "price": 0,
        "emoji": "📊"
    },
    "🏆": {
        "name": "Кубок Далбаеба",
        "description": "Настоящий далбаеб",
        "price": 0,
        "emoji": "🏆"
    },
    "🕳": {
        "name": "Нихуя",
        "description": "Нихуя не делает",
        "price": 0,
        "emoji": "🕳"
    },
    "❄️": {
        "name": "Снежинка",
        "description": "Для крафта снеговика",
        "price": 0,
        "emoji": "❄️"
    },
    "🍃": {
        "name": "Табак",
        "description": "Можно прикурнуть",
        "price": 0,
        "emoji": "🍃"
    },
    "📜": {
        "name": "Старая бумага",
        "description": "Для крафта",
        "price": 0,
        "emoji": "📜"
    },
    "⚠️": {
        "name": "Внимание",
        "description": "Избирательная направленность восприятия на тот или иной объект (+1 к удаче)",
        "price": 0,
        "emoji": "⚠️"
    },
    "💩": {
        "name": "Кучка говна",
        "description": "не дает писать 1 минуту ",
        "price": 0,
        "emoji": "💩"
    },
    "🧬": {
        "name": "ДНК отчимного хера",
        "description": "Наследственный (+5 к выносливости)",
        "price": 0,
        "emoji": "🧬"
    },
    "🎞": {
        "name": "Кинолента",
        "description": "Показывает отрывок старого мема (+1 к удаче)",
        "price": 0,
        "emoji": "🎞"
    },
    "🏀": {
        "name": "Баскетбольный мяч",
        "description": "Хуйня",
        "price": 0,
        "emoji": "🏀"
    },
    "🏚": {
        "name": "Барак",
        "description": "Старый сарай от деда (+2 к выносливости, -1 к удаче)",
        "price": 0,
        "emoji": "🏚"
    },
    "🏠": {
        "name": "Дом",
        "description": "Нормальный дом (+3 к выносливости)",
        "price": 0,
        "emoji": "🏠"
    },
    "🏰": {
        "name": "Замок",
        "description": "Ахуеный дом (+5 к выносливости)",
        "price": 0,
        "emoji": "🏰"
    },


    "🍬": {
        "name": "Барбариска",
        "description": "Для похуистов",
        "price": 0,
        "emoji": "🍬"
    },
    "👛": {
        "name": "Колешёк мамы",
        "description": "С деньгами",
        "price": 0,
        "emoji": "👛"
    },
    "🧢": {
        "name": "Кепка",
        "description": "Для аутистов",
        "price": 0,
        "emoji": "🧢"
    },
    "🐺": {
        "name": "Костян Киберволк",
        "description": "Быдло",
        "price": 0,
        "emoji": "🐺"
    },
    "🐔": {
        "name": "Клеймо Петуха",
        "description": "Настоящий Петух",
        "price": 0,
        "emoji": "🐔"
    },

    "📙": {
        "name": "Наследие Олда",
        "description": "Тот кто прошел настоящий путь Олда",
        "price": 0,
        "emoji": "📙"
    },

    "🇫🇲": {
        "name": "Old's drochs",
        "description": "Для олдов ФармДроча",
        "price": 0,
        "emoji": "🇫🇲"
    },

    "🚗": {
        "name": "Супер-car",
        "description": "Давно тебя не было в уличных гонках!",
        "price": 0,
        "emoji": "🚗"
    },
    "🩸": {
        "name": "Кровь",
        "description": "Не для вампиров",
        "price": 0,
        "emoji": "🩸"
    },
    "📗": {
        "name": "Заметки создателя Х",
        "description": "Интересные",
        "price": 0,
        "emoji": "📗"
    },
    "🚬": {
        "name": "Сигарета",
        "description": "Увеличивает выносливость на 10% на 12 часов и снижает стресс",
        "price": 0,
        "emoji": "🚬"
    },
    "💕": {
        "name": "Валентинка",
        "description": "В честь 14 февраля",
        "price": 0,
        "emoji": "💕"
    },
    "⛄️": {
        "name": "Снеговик",
        "description": "Даёт +5 к удаче на 24 часа",
        "price": 0,
        "emoji": "⛄️"
    },
    "🍹": {
        "name": "COCKтейль",
        "description": "Коктейль для роста хуя",
        "price": 0,
        "emoji": "🍹"
    },
    "🎧": {
        "name": "Наушники JBL",
        "description": "Это не ляшки твоей одноклассницы!",
        "price": 0,
        "emoji": "🎧"
    },
    "🦠": {
        "name": "Дрочвирус",
        "description": "Хуёвая болезнь (выносливость -30% на 5 дней)",
        "price": 0,
        "emoji": "🦠"
    },
    "🎄": {
        "name": "Ёлка",
        "description": "Уют дома (+2 удача, +5 выносливость)",
        "price": 0,
        "emoji": "🎄"
    },
    "👊": {
        "name": "В ебалО",
        "description": "Кого-нибудь пиздануть (боту нужны права на бан)",
        "price": 0,
        "emoji": "👊"
    },
    "🥳": {
        "name": "Праздничный колпак",
        "description": "День рождения!",
        "price": 0,
        "emoji": "🥳"
    },
    "👙": {
        "name": "Трусики снап снапа",
        "description": "Отключают дебаф “не нашел подходящего материала”",
        "price": 0,
        "emoji": "👙"
    },
    "🎶": {
        "name": "Песня с Плантации",
        "description": "Опера",
        "price": 0,
        "emoji": "🎶"
    },
    "💰": {
        "name": "Фармкоин",
        "description": "Валюта",
        "price": 0,
        "emoji": "💰"
    },
"🪙": {
        "name": "Фрага",
        "description": "Премиум-валюта",
        "price": 0,
        "emoji": "🪙"
    },

    "💐": {
        "name": "Букет цветов",
        "description": "К 8 марта. (повышение удачи и выносливости на 5%)",
        "price": 0,
        "emoji": "💐"
    },
    "🎁": {
        "name": "Супер-кейс",
        "description": "С подарком",
        "price": 0,
        "emoji": "🎁"
    },
    "💎": {
        "name": "Кубок Легенды",
        "description": "За 50000 дрочек",
        "price": 0,
        "emoji": "💎"
    },
    "🔰": {
        "name": "Значок летофага",
        "description": "Для любителей Бесконечного Лета",
        "price": 0,
        "emoji": "🔰"
    },
    "🧨": {
        "name": "Динамит",
        "description": "Чтобы подорвать задницу (повышение удачи на +1%)",
        "price": 0,
        "emoji": "🧨"
    },
    "🏴‍☠️": {
        "name": "Флаг Карибского моря",
        "description": "Я Джек Воробей",
        "price": 0,
        "emoji": "🏴‍☠️"
    },
    "🏁": {
        "name": "Флаг Финиша",
        "description": "Можно вставить в жопу",
        "price": 0,
        "emoji": "🏁"
    },

    "🏳️‍⚧️": {
        "name": "Флаг Miside",
        "description": "Для мисайдеров",
        "price": 0,
        "emoji": "🏳️‍⚧️"
    },

    "🎖️": {
        "name": "Медаль Beta-Тестера",
        "description": "За помощь в разработке бота",
        "price": 0,
        "emoji": "🎖️"
    },

    "🦋": {
        "name": "Бабочка",
        "description": "Вид павлиньих",
        "price": 0,
        "emoji": "🦋"
    },

    "👑": {
        "name": "Корона",
        "description": "Для реферального короля",
        "price": 0,
        "emoji": "👑"
    },

    "🇦🇱": {
        "name": "Флаг албании",
        "description": "Для албанцев",
        "price": 0,
        "emoji": "🇦🇱"
    },

    "🛡": {
        "name": "Щит великого дрочуна",
        "description": "Позволяет уклониться от кирпича раз 10 минут, не потеряв каску",
        "price": 0,
        "emoji": "🛡"
    },



"🔧": {
        "name": "Ржавый ключ на 10",
        "description": "Ключ которого нету никогда, когда батя просит",
        "price": 0,
        "emoji": "🔧"
    },
    "🔩": {
        "name": "Старый болт",
        "description": "Обычнго дедовский",
        "price": 0,
        "emoji": "🔩"
    },
    "⚙️": {
        "name": "Шестеренка",
        "description": "Можно кому то выбить зубы",
        "price": 0,
        "emoji": "⚙️"

    },
    "🔋": {
        "name": "Севшая батарейка",
        "description": "В ней не осталось ни капли энергии.",
        "price": 0,
        "emoji": "🔋"
    },
    "📦": {
        "name": "Пустая коробка",
        "description": "Промокший картон, пахнущий сыростью.",
        "price": 0,
        "emoji": "📦"
    },
    "🪑": {
        "name": "Стул тети Зины",
        "description": "Неубиваемый сука",
        "price": 0,
        "emoji": "🪑"
    },
    "🛢️": {
        "name": "Пустая бочка",
        "description": "Ржавая емкость, в которой когда-то было дохуя смазки.",
        "price": 0,
        "emoji": "🛢️"

    },
    "🧺": {
        "name": "Дырявая корзина",
        "description": "Плетеная корзинка, которая больше нихуя не удержит.",
        "price": 0,
        "emoji": "🧺"
    },


    "🔨": {
        "name": "Гнилой молоток",
        "description": "Когда то им давали по ебалу Надину",
        "price": 0,
        "emoji": "🔨"
    },
    "🧹": {
        "name": "Старая метла",
        "description": "Блять выходи отсюда, сука убью нахуй блять",
        "price": 0,
        "emoji": "🧹"
    },
    "🏺": {
        "name": "Черепок вазы",
        "description": "Осколок чего-то, что когда-то стояло в кабинете директора.",
        "price": 0,
        "emoji": "🏺"
    },
    "📀": {
        "name": "Поцарапанный диск",
        "description": "На нем записаны чертежи или старая музыка.",
        "price": 0,
        "emoji": "📀"
    },
    "☎️": {
        "name": "Ебаный телефон",
        "description": "Устройство связи из далекого прошлого.",
        "price": 0,
        "emoji": "☎️"
    },
    "📺": {
        "name": "Ламповый ТВ (с порнушкой)",
        "description": "Тяжелый епта, который уже ничего не покажет.",
        "price": 0,
        "emoji": "📺"
    },
    "🧥": {
        "name": "Куртка дрочуна",
        "description": "Рабочая одежда, забытая кем-то в раздевалке.",
        "price": 0,
        "emoji": "🧥"
    },
    "🍌": {
        "name": "Банан",
        "description": "Главная награда сезона Банановый Переполох",
        "price": 0,
        "emoji": "🍌"
},
    "🦄": {
        "name": "Единорог",
        "description": "с вероятностью 2% при юзе выдает миллион ФК",
        "price": 0,
        "emoji": "🦄"
},

}




